import create_test_data
import png

create_test_data.main()
png.main()

# СЛОЖНОСТЬ АЛГОРИТА n * log2(n)
# На самом деле n * log2(n) + n. поэтому возникла эта погрешность в 10%

# 10 ** 3 * log2(10**3)
# 10 ** 4 = 0.002

# 10 ** 4 * log2(10 ** 4)
# 1.3 * 10 ** 5 = 0.026
# практически разница должны быть 13
# теоретически разница должны быть 13

# 10 ** 6 * log2(10**6) =
# 2 * 10 ** 7 = 4.43
# 2215 - 2000 = 215.
# 10% погрешность

# 10 ** 6 * log2(10**6) + 10 ** 6 =
# 2.1 * 10 ** 7 = 4.43

# 2215 - 2100 = 115
# 5% погрешность.
